# BuiltInFailures.DuctFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DuctFailures Class
BuiltInFailures Class Members See Also
---
Failures about Duct.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class DuctFailures
```

Visual Basic
---
```text
Public NotInheritable Class DuctFailures
```

Visual C++
---
```text
public ref class DuctFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..DuctFailures
# See Also
BuiltInFailures..::..DuctFailures Members
Autodesk.Revit.DB Namespace